//Pathfinder

Файла с GPS координатите, как да си направим собствен такъв?

От къде идва това https://youtube.com/embed -> това embed от къде идва и кои 11
character копираме, ако искаме да сменим видеото?


Може ли някакви примера за Interceptors? Освен за статистика на влизане в апликацията
както сте показали в миналото издание. зададено -> сайта на английкски сайта на български,
казахте, че може да покажете.

Books, ще го довършим ли?



Може ли да покажем как в HTML form да направим така, че снимката да се 
дърпа от Cloudinary? 


Как в HTML мога да взема от UserEntity fullName, age, email and etc с thymeleaf sec?
Видях, че си ми отговорим в github, но ми е трудно ако може да го покажеш за 5-10 мин.,
с имплементация на mobilele както сме го направили(ако може по двата начина единия клас да
наследи UserDetails, другия директно в контролера), мисля че ще е полезно и за колегите.



Отговорени върпоси:

Kak мога да променя запаметен вече username в базата данни по ID? -> 
-> userRepository findById, връща Optional<User> допускаме, че user съществува
и му казваме SET user, и в UserRopositoryto, извикаваме метода save и подаваме user.
Ako username е уникален трябва да се провери дали не съществува вече новия username.

Как да свържем Cloudinary с проекта? -> копираме всичко(което сте показали в миналото
 издание) - (class, repository)
и други в нашия проект ли?
Нещо допълнително прави ли се? -> не но го нагаждаме спрямо проекта.

Kak може да направим филтриране да виждаме само нашите
добавени коли/места/item и т.н. да ги визуализираме? -> виж изпита по basic web

Със Spring Security във всички Class на App ще имаме ли достъп до ID на текущия логнат
потребител, примерно като добавяме оферта или нещо друго, може ли да покажете? ->
Pricipal 35 слайд от презентацията за Spring Security

Как мога да взема със Spring Sec, информацията от UserEntity, примерно firstName, lastName 
и тн? -> виж в гоогле

